Revit 2027 API
ParameterTypeId.RebarSystemHookOrientFrontDirn1 Property
 "Exterior Major Hook Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookOrientFrontDirn1 { get; }
Public Shared ReadOnly Property RebarSystemHookOrientFrontDirn1 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookOrientFrontDirn1 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookOrientFrontDirn1 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace